Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder.Prepend Method
Overload List
Name | Description
Prepend(Arc)
 Prepends an arc to the geometry list
Prepend(LineSegment)
 Prepends a line segment to the geometry list
Top
See Also
Reference
PolycurveGeometryBuilder Class
Tekla.Structures.Geometry3d Namespace